import React from "react";

import {ObjectsFiltersBlockWrapper, TitleIcon, Checkbox} from "../../";

const ObjectsFiltersThemes: React.FC = () => {
    const themes = [
        "Премиальный дизайн",
        "Романтика / медовый месяц",
        "СПА / Здоровье",
        "Бюджетные/молодежные поездки",
        "Необычная задумка",
        "Спортивный отдых",
    ];

    return (
        <ObjectsFiltersBlockWrapper
            allBtnVisible={themes.length > 4 ? true : false}
        >
            <div className="objects-filters-block-title">
                <TitleIcon title="Тема отеля" marginBottom>
                    <svg
                        width="18"
                        height="14"
                        viewBox="0 0 18 14"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                    >
                        <path
                            d="M13.4993 13.6654C13.7755 13.6654 13.9993 13.4415 13.9993 13.1654V4.16414C13.9993 4.03153 13.9467 3.90435 13.8529 3.81058L10.5208 0.478478C10.427 0.384709 10.2998 0.332031 10.1672 0.332031H9.22312C8.77767 0.332031 8.55459 0.870602 8.86957 1.18558L12.1862 4.50225C12.28 4.59602 12.3327 4.7232 12.3327 4.8558V13.1654C12.3327 13.4415 12.5565 13.6654 12.8327 13.6654H13.4993ZM16.8327 13.6654C17.1088 13.6654 17.3327 13.4415 17.3327 13.1654V2.7808C17.3327 2.6482 17.28 2.52102 17.1862 2.42725L15.2375 0.478478C15.1437 0.38471 15.0165 0.332031 14.8839 0.332031H13.9398C13.4943 0.332031 13.2713 0.870602 13.5862 1.18558L15.5196 3.11892C15.6133 3.21269 15.666 3.33986 15.666 3.47247V13.1654C15.666 13.4415 15.8899 13.6654 16.166 13.6654H16.8327ZM6.01957 0.685585C5.82431 0.490323 5.50772 0.490323 5.31246 0.685585L0.812462 5.18558C0.718694 5.27935 0.666016 5.40653 0.666016 5.53914V13.1654C0.666016 13.4415 0.889873 13.6654 1.16602 13.6654H4.33268C4.60882 13.6654 4.83268 13.4415 4.83268 13.1654V9.9987C4.83268 9.72256 5.05654 9.4987 5.33268 9.4987H5.99935C6.27549 9.4987 6.49935 9.72256 6.49935 9.9987V13.1654C6.49935 13.4415 6.72321 13.6654 6.99935 13.6654H10.166C10.4422 13.6654 10.666 13.4415 10.666 13.1654V5.53914C10.666 5.40653 10.6133 5.27935 10.5196 5.18558L6.01957 0.685585ZM6.49935 7.33203C6.49935 7.60817 6.27549 7.83203 5.99935 7.83203H5.33268C5.05654 7.83203 4.83268 7.60817 4.83268 7.33203V6.66536C4.83268 6.38922 5.05654 6.16536 5.33268 6.16536H5.99935C6.27549 6.16536 6.49935 6.38922 6.49935 6.66536V7.33203Z"
                            fill="#00A0A0"
                        />
                    </svg>
                </TitleIcon>
            </div>

            <div className="objects-filters-block-checkboxes">
                {themes.map((theme, index) => (
                    <div
                        className="objects-filters-block-checkbox"
                        key={`objects-filters-block-checkbox-themes-${index}`}
                    >
                        <Checkbox small>{theme}</Checkbox>
                    </div>
                ))}
            </div>
        </ObjectsFiltersBlockWrapper>
    );
};

export default ObjectsFiltersThemes;
